run/coffeePot/system/fluid/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/fluid";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue T 350
    volScalarFieldValue T.air 350
    volScalarFieldValue T.water 350
);

regions
(
    boxToCell
    {
        box (-100 -100 -100) (100 0.04 100);
        fieldValues
        (
            volScalarFieldValue T 370
            volScalarFieldValue T.air 370
            volScalarFieldValue T.water 370
        );
    }
);


// ************************************************************************* //
